In [2]:
import numpy as np
import pandas as pd

df=pd.read_csv("property_data.csv")
df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y           --        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [ ]:
for idx,row in df.itterows():
    if type(row['NUM_BATH'])!=float:
        if type(row['NUM_BATH']).isdecimal():
            df.loc[idx,'NUM_BATH']=int(row['NUM_BATH'])

In [3]:
import matplotlib.pyplot as plt

data=pd.ExcelFile("obes.xls")

In [4]:
data.sheet_names

['Chapter 7',
 '7.1',
 '7.2',
 '7.3',
 '7.4',
 '7.5',
 '7.6',
 '7.7',
 '7.8',
 '7.9',
 '7.10']

In [5]:
df_age=data

In [6]:
df_age.plot()

AttributeError: 'ExcelFile' object has no attribute 'plot'